var filmacc = `장비명     텐타클 백
장비 타입     악세서리    레벨 제한     410 렙 이상
장비옵션
 * 강화비용 4 배 증가 *
 * 강화성공률 7 % 감소 *

기본 방어력     물리방어 : + 1390 / 마법방어력 : + 1390
속성 방어력     불속성 : -420 / 물속성 : 0 / 바람속성 : 0
 땅속성 : 0 / 정신속성 : 0 / 아스트랄속성 : + 1500
에테르     7
피트    히든 개더링 (+ 7)
예감 (+ 6)
수집욕 (+ 5)
마비 (-5)
피어 투 파이어 (-6)
엘레멘트 소켓    3 개 ~ 5 개
커스텀옵션    강한 흡혈 기능 ( 5 % ~ 12 % ) [100% 확률]
루엘 파편 추가 획득 기능 ( 2 % ~ 6 % ) [100% 확률]
루엘 파편 추가 획득 기능 ( 2 % ~ 6 % ) [10% 확률]
커먼 보석 복사 기능 ( 2 % ~ 6 % ) [60% 확률]
커먼 보석 복사 기능 ( 2 % ~ 6 % ) [10% 확률]
일반 커먼 수집품 복사 기능 ( 2 % ~ 6 % ) [50% 확률]
일반 커먼 수집품 복사 기능 ( 2 % ~ 6 % ) [10% 확률]`

var filmwp2 = `
MRICTX-RAY 촬영 결과


당신이 의뢰한 물품 빗자루 의 촬영 결과는 다음과 같이 나왔습니다.


장비명 	 빗자루
장비 타입 	 무기 	레벨 제한 	 10 렙 이상
장비옵션

속성 	 마법 / 무속성 / 없음 / 1 레벨
공격력 	 주 공격력 : + 30 / 추가타 공격력 : + 10
에테르 	 0
무기대사 	 캐릭터 이름 (이)/가 손짓하자 빗자루가 날아가 적의 얼굴을 밀어버린다.
추가타대사 	 캐릭터 이름
웨폰 폼 	 없음
웨이블렘 스킬
피트 	루엘 (+ 1)
엘레멘트 소켓 	2 개 ~ 3 개
커스텀옵션 	2 회 공격 기능 ( 1 % ~ 10 % ) [100% 확률]


메인 화면으로 | 다른것을 촬영 | 텐시 백화점으로
`
var darkmarketacc = `黃泉布 : 황천녀의 어둠깃옷

티어 : [[ 1 ]]
550 렙 이상 / + 4400 / + 3600
속성방어 : 0 / 0 / -2500 / + 3400 / 0 / + 5200

에테르 : 27

****** 피트 ******
물리 공격 (+ 7)
영력 (+ 6)
컨트랙트 : 에너지 (+ 6)
더블 (+ 5)
블랙 세븐 스타즈 (+ 3)
디펜시브 페이즈 (-5)
레지스트 파이어 (-5)
수집 (-5)


****** 엘레멘트 소켓 ******
2 개 ~ 4 개

****** 커스텀 ( 8 등급 ) ******
파워 컨버트 : 피지컬 디펜스 ( 0.8 % ~ 3.5 % )
파워 컨버트 : 피지컬 디펜스 ( 1 % ~ 3.5 % )
중간 흡혈 기능 ( 2 % ~ 5 % )
추가 데미지 변화 ( 4 % ~ 12 % )
실드 HP 추가 ( 2 % ~ 6 % )
두 소녀 이야기의 단서추적 ( 5 ~ 50 )
고정몹 수집품 취득 확률 변화 ( 5 ~ 30 )
고정몹 수집품 취득 확률 변화 ( 10 ~ 40 )`
var filmwp = `장비명     트루 소울 파이어
장비 타입     무기    레벨 제한     520 렙 이상
장비옵션
 * 강화비용 9 배 증가 *
 * 강화성공률 5 % 감소 *

속성     마법 / 불 / 비염 / 2 레벨
공격력     주 공격력 : + 4330 / 추가타 공격력 : + 4550
에테르     28
무기대사     캐릭터 이름 (/이)/가 트루 소울 파이어의 영창을 읆조리며 손을 뻗치자 영혼마저 태우는 진정한 불길이 적을 태운다.
추가타대사     캐릭터 이름 의 트루 소울 파이어 주문이 폭주하여 일렁거리는 거대한 화염구를 구성하기 시작한다!!
웨폰 폼     마법 / 불 / 비염 / 2 레벨
 마법 / 불 / 없음 / 3 레벨

웨이블렘 스킬    연화의 마인 (1티어)
진 · 화인장 (4티어)
피트    컨트랙트 : 소드 (+ 8)
마인드 마크 (+ 7)
소울 (+ 6)
불 속성 공격 (+ 5)
렌샤드의 축복 (+ 5)
레드 앱저버 (+ 4)
재생 (+ 3)
피어 투 아스트랄 (-7)
명중 (-7)
엘레멘트 소켓    2 개 ~ 3 개
커스텀옵션    크리티컬률 변화 ( 3 % ~ 7 % ) [100% 확률]
중간 재생 기능 ( 5 % ~ 13 % ) [100% 확률]
퀘스트 아이템 드랍율 증가 ( 15 ~ 50 ) [100% 확률]
불의 결정 추출 기능 ( 5 ~ 35 ) [60% 확률]
스타라이터 : 알티아 ( 15 ~ 40 ) [70% 확률]
불의 결정 추출 기능 ( 8 ~ 40 ) [30% 확률]
스타라이터 : 알티아 ( 10 ~ 45 ) [25% 확률]
맨카인드 슬레이어 ( 5 ~ 30 ) [75% 확률]
고스트 슬레이어 ( 5 ~ 30 ) [75% 확률]
인스태블 슬레이어 ( 5 ~ 30 ) [65% 확률]
뮤턴트 슬레이어 ( 5 ~ 30 ) [65% 확률]`
var darkmarketwp = `天幻雷術 : 셀레라이트닝

티어 : [[ 2 ]]
570 렙 이상 / + 4443 / + 6821
마법 / 정신 / 일루젼 / 2 레벨

에테르 : 35

****** 웨이블렘 스킬 ******


****** 피트 ******
크리티컬 페이즈 (+ 10)
마인드 마스터리 (+ 6)
리밋 페이즈 (+ 5)
화이트 세븐 스타즈 (+ 5)
부가근력 (+ 5)
시력 (-5)
환각 (-6)
소울 (-6)


****** 엘레멘트 소켓 ******
1 개 ~ 3 개

****** 커스텀 ( 8 등급 ) ******
고정몹 전투시 데미지 변화 ( 2 % ~ 10 % )
고정몹 전투시 데미지 변화 ( 4 % ~ 10 % )
절대 방어 기능 ( 1 % ~ 5 % )
절대 방어 기능 ( 2 % ~ 5 % )
소울 다이아몬드 추출 기능 ( 10 ~ 70 )
스타라이터 : 알티아 ( 15 ~ 65 )
아스트랄 어벤져 ( 3 % ~ 14 % )
마인드 디펜스 컨버트 : 서브 파워 ( 0.8 % ~ 2.5 % )
마인드 디펜스 컨버트 : 서브 파워 ( 1 % ~ 2.5 % )

웨폰 폼 : [마법 / 정신 / 일루젼 / 2 레벨][마법 / 정신 / 플라즈마 / 3 레벨][마법 / 정신 / 없음 / 4 레벨]`





var revers1 = `
작업 대상 상세정보
선택한 대상의 상세정보와 필요 재료, 재료 보유 상태등을 확인할 수 있습니다.
만일 모든 재료가 충분하고 기본 수수료를 지불한다면 즉시 업그레이드 작업을 진행할 수 있습니다.
대상이 장비류인 경우에 장비의 루엘, 커스텀, 강화수치등을 보존하기 위한 추가 아이템을 작업 진행시에 사용할 수 있습니다.
재료 중 카운터 유형의 재료인경우 [각인]버튼을 클릭하여 최초 1 개의 카운터를 획득할 수 있습니다.
카운터 유형의 재료인경우 [각인] 후에는 표시되는 정보를 보고 조건을 맞춰 증식이 가능합니다.
※ 업그레이드 작업 진행시에 지불한 재료와 기본 수수료는 즉시 소멸하며 되돌릴 수 없으므로 신중하게 생각하신 후에 진행해 주시기 바랍니다.



대상 명칭 	  스피릿 그레이트 소드
대상 등급 	  5 등급
업그레이드 명칭 	  스피릿 매시브 소드
업그레이드 등급 	  6 등급
업그레이드 정보
	스피릿 매시브 소드

티어 : [[ 1 ]]
330 렙 이상 / + 2381 / + 828
마법 / 무속성 / 에너지 / 2 레벨

에테르 : 16

****** 웨이블렘 스킬 ******
무의 인장 (1티어)
프록 리미터 릴리즈 (3티어)


****** 피트 ******
그레이 마스터리 (+ 5)
소울 (+ 4)
부가근력 (+ 3)
리인포스 (+ 3)
명중 (-3)
방어 (-5)


****** 엘레멘트 소켓 ******
1 개 ~ 4 개

****** 커스텀 ( 6 등급 ) ******
실드 HP 추가 ( 3 % ~ 7 % )
힘의 세피라 ( 6 ~ 20 )
추가타 발동 확률 변화 ( 2 % ~ 5 % )
매지컬 앰프 ( 3 % ~ 8 % )
커먼 보석 복사 기능 ( 3 % ~ 7 % )
마인드 디펜스 컨버트 : 파워 ( 0.4 % ~ 1.8 % )
아스트랄 디펜스 컨버트 : 파워 ( 0.4 % ~ 1.8 % )

웨폰 폼 : [마법 / 무속성 / 에너지 / 2 레벨][마법 / 바람 / 충격 / 2 레벨]
기본 수수료 	  60,000,000 원 / ( 498,699,654 원 보유 )
루엘 승계석 	  [ 목제 루엘 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비에 장착되어 있던 루엘을 그대로 계승한 채로 업그레이드를 할 수 있습니다. (사용시 아이템 소멸).
커스텀 승계석 	  [ 목제 커스텀 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비의 기본 커스텀 수치와 커스텀 효과 목록과 수치를 그대로 계승한 채로 업그레이드를 할 수 있습니다. (사용시 아이템 소멸).
강화 승계석 	  [ 목제 강화 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비의 강화 수치를 - 3 강화 상태로 계승한 채로 업그레이드를 할 수 있습니다. 무기인 경우 무기 최대 레벨이 15 감소하며 무기 레벨도 그에 맞게 감소합니다. 3 강 이하의 장비에는 사용할 수 없습니다. (사용시 아이템 소멸)
※ 업그레이드 결과 장비가 6 등급 이하인 경우 - 2 강화 상태, 10 레벨 감소


스피릿 매시브 소드 작업 재료 목록
재료 1 	카운터 	 스피릿 그레이트 소드의 마혼
 - 대상 무기를 장착하고 마법속성의 적에게 수행에서 승리 	5350 개 	126 개 보유 ( 2.36 % )
재료 2 	수집품 	 스피릿 큐브 [ #6420 ] 	18 개 	0 개 보유 ( 0 % )
재료 3 	수집품 	 얼음 칼날 [ #6429 ] 	18 개 	0 개 보유 ( 0 % )
재료 4 	수집품 	 익스퍼트 마법서 [ #12215 ] 	2 개 	0 개 보유 ( 0 % )
재료 5 	아이템 	 고급 매터리얼 열매 	78 개 	144 개 보유 ( 100 % )
재료 6 	보석 	 옵시디안 	56 개 	281 개 보유 ( 100 % )
작업 준비 공정 : 33.73 % 완료


텐시 백화점으로 | 메인 화면으로 `
var revers2 = `
작업 대상 상세정보
선택한 대상의 상세정보와 필요 재료, 재료 보유 상태등을 확인할 수 있습니다.
만일 모든 재료가 충분하고 기본 수수료를 지불한다면 즉시 업그레이드 작업을 진행할 수 있습니다.
대상이 장비류인 경우에 장비의 루엘, 커스텀, 강화수치등을 보존하기 위한 추가 아이템을 작업 진행시에 사용할 수 있습니다.
재료 중 카운터 유형의 재료인경우 [각인]버튼을 클릭하여 최초 1 개의 카운터를 획득할 수 있습니다.
카운터 유형의 재료인경우 [각인] 후에는 표시되는 정보를 보고 조건을 맞춰 증식이 가능합니다.
※ 업그레이드 작업 진행시에 지불한 재료와 기본 수수료는 즉시 소멸하며 되돌릴 수 없으므로 신중하게 생각하신 후에 진행해 주시기 바랍니다.



대상 명칭 	  골판 아머
대상 등급 	  3 등급
업그레이드 명칭 	  강화 골판 아머
업그레이드 등급 	  4 등급
업그레이드 정보
	강화 골판 아머

티어 : [[ 1 ]]
160 렙 이상 / + 676 / + 348
속성방어 : -160 / -80 / + 120 / + 350 / 0 / 0

에테르 : 0

****** 피트 ******
라스트 (+ 5)
물리 무기 숙련 (+ 4)
카운터 (+ 4)
커스텀 (+ 3)
크리티컬 (-4)


****** 엘레멘트 소켓 ******
0 개 ~ 3 개

****** 커스텀 ( 4 등급 ) ******
메일 프로텍터 ( 4 ~ 13 )
스태미너 피해 변화 ( 0 ~ 3 )
소울 브라운 쿼츠 추출 ( 4 ~ 13 )
수집품 취득 확률 변화 ( 6 ~ 22 )
기반의 세피라 ( 5 ~ 12 )

기본 수수료 	  5,000,000 원 / ( 498,699,654 원 보유 )
루엘 승계석 	  [ 목제 루엘 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비에 장착되어 있던 루엘을 그대로 계승한 채로 업그레이드를 할 수 있습니다. (사용시 아이템 소멸).
커스텀 승계석 	  [ 목제 커스텀 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비의 기본 커스텀 수치와 커스텀 효과 목록과 수치를 그대로 계승한 채로 업그레이드를 할 수 있습니다. (사용시 아이템 소멸).
강화 승계석 	  [ 목제 강화 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비의 강화 수치를 - 3 강화 상태로 계승한 채로 업그레이드를 할 수 있습니다. 무기인 경우 무기 최대 레벨이 15 감소하며 무기 레벨도 그에 맞게 감소합니다. 3 강 이하의 장비에는 사용할 수 없습니다. (사용시 아이템 소멸)
※ 업그레이드 결과 장비가 6 등급 이하인 경우 - 2 강화 상태, 10 레벨 감소


강화 골판 아머 작업 재료 목록
재료 1 	카운터 	 골판 아머의 혼
 - 대상 방어구를 장착하고 수행에서 승리 	2000 개 	2000 개 보유 ( 100 % )
재료 2 	수집품 	 종이 반죽 브래이지어 [ #6423 ] 	6 개 	0 개 보유 ( 0 % )
재료 3 	아이템 	 클로스 티켓 	32 개 	5 개 보유 ( 15.63 % )
작업 준비 공정 : 38.54 % 완료


텐시 백화점으로 | 메인 화면으로 `
var revers3 = `
작업 대상 상세정보
선택한 대상의 상세정보와 필요 재료, 재료 보유 상태등을 확인할 수 있습니다.
만일 모든 재료가 충분하고 기본 수수료를 지불한다면 즉시 업그레이드 작업을 진행할 수 있습니다.
대상이 장비류인 경우에 장비의 루엘, 커스텀, 강화수치등을 보존하기 위한 추가 아이템을 작업 진행시에 사용할 수 있습니다.
재료 중 카운터 유형의 재료인경우 [각인]버튼을 클릭하여 최초 1 개의 카운터를 획득할 수 있습니다.
카운터 유형의 재료인경우 [각인] 후에는 표시되는 정보를 보고 조건을 맞춰 증식이 가능합니다.
※ 업그레이드 작업 진행시에 지불한 재료와 기본 수수료는 즉시 소멸하며 되돌릴 수 없으므로 신중하게 생각하신 후에 진행해 주시기 바랍니다.



대상 명칭 	  프린세스 크라운
대상 등급 	  4 등급
업그레이드 명칭 	  하이 프린세스 크라운
업그레이드 등급 	  5 등급
업그레이드 정보
	하이 프린세스 크라운

티어 : [[ 1 ]]
190 렙 이상 / + 360 / + 800
속성방어 : -150 / 0 / -150 / -150 / 0 / + 450

에테르 : 0

****** 피트 ******
금전 (+ 3)
수면 (+ 3)
젬 컨슈머 (+ 3)
컨트랙트 : 헤븐 (+ 2)
소울 (-3)


****** 엘레멘트 소켓 ******
1 개 ~ 4 개

****** 커스텀 ( 5 등급 ) ******
페이즈 변화 ( 1 ~ 2 )
페이즈 변화 ( 1 ~ 2 )
보석 취득 확률 변화 ( 2 ~ 7 )
보석 취득 확률 변화 ( 3 ~ 7 )
소울 커먼 보석 추출 ( 3 ~ 9 )

기본 수수료 	  20,000,000 원 / ( 498,699,654 원 보유 )
루엘 승계석 	  [ 목제 루엘 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비에 장착되어 있던 루엘을 그대로 계승한 채로 업그레이드를 할 수 있습니다. (사용시 아이템 소멸).
커스텀 승계석 	  [ 목제 커스텀 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비의 기본 커스텀 수치와 커스텀 효과 목록과 수치를 그대로 계승한 채로 업그레이드를 할 수 있습니다. (사용시 아이템 소멸).
강화 승계석 	  [ 목제 강화 승계석 필요 ] 사용함 ( 0 개 보유중 )
※ 사용시에 원본이 되는 장비의 강화 수치를 - 3 강화 상태로 계승한 채로 업그레이드를 할 수 있습니다. 무기인 경우 무기 최대 레벨이 15 감소하며 무기 레벨도 그에 맞게 감소합니다. 3 강 이하의 장비에는 사용할 수 없습니다. (사용시 아이템 소멸)
※ 업그레이드 결과 장비가 6 등급 이하인 경우 - 2 강화 상태, 10 레벨 감소


하이 프린세스 크라운 작업 재료 목록
재료 1 	카운터 	 프린세스 크라운의 혼
 - 대상 악세서리를 장착하고 수행에서 승리 	4080 개 	4080 개 보유 ( 100 % )
재료 2 	수집품 	 프린세스 크라운 [ #9016 ] 	5 개 	9 개 보유 ( 100 % )
재료 3 	수집품 	 보석 찌끄레기 [ #306 ] 	15 개 	4 개 보유 ( 26.67 % )
재료 4 	아이템 	 밸류어블 티켓 	65 개 	4 개 보유 ( 6.15 % )
작업 준비 공정 : 58.21 % 완료


텐시 백화점으로 | 메인 화면으로 `

// 유물 복원 시  무기
var darkmark1 = `
유물 상세정보
선택한 유물의 상태를 보여줍니다.
복원시의 스펙을 볼 수 있으며, 모든 유물 조각이 필요 세트 수만큼 존재하면 복원을 시도할 수 있습니다.
복원시에는 수수료가 소비되며, 수수료가 없는 경우에는 바로 복원이 가능 합니다.
복원을 통해 수집품이나 장비류를 지급받을 수도 있으며 집이 없거나 창고가 온전하지 않은 경우에는 우편으로 보내집니다. (30 일 내에 수령해야 합니다.)


유물 명칭 	  셀레라이트닝 주문서 조각
유물 등급 	  77 등급
총 조각 / 필요 세트 	  30 조각 / 1 세트 필요
복원 제한 	  앞으로 복원이 1 회 가능합니다.
복원 옵션
복원 수수료 	[ 보석 ] 아메시스트 111 개
복원 결과물 	  天幻雷術 : 셀레라이트닝 ( 무기 )
복원물 정보
	天幻雷術 : 셀레라이트닝

티어 : [[ 2 ]]
570 렙 이상 / + 4443 / + 6821
마법 / 정신 / 일루젼 / 2 레벨

에테르 : 35

****** 웨이블렘 스킬 ******


****** 피트 ******
크리티컬 페이즈 (+ 10)
마인드 마스터리 (+ 6)
리밋 페이즈 (+ 5)
화이트 세븐 스타즈 (+ 5)
부가근력 (+ 5)
시력 (-5)
환각 (-6)
소울 (-6)


****** 엘레멘트 소켓 ******
1 개 ~ 3 개

****** 커스텀 ( 8 등급 ) ******
고정몹 전투시 데미지 변화 ( 2 % ~ 10 % )
고정몹 전투시 데미지 변화 ( 4 % ~ 10 % )
절대 방어 기능 ( 1 % ~ 5 % )
절대 방어 기능 ( 2 % ~ 5 % )
소울 다이아몬드 추출 기능 ( 10 ~ 70 )
스타라이터 : 알티아 ( 15 ~ 65 )
아스트랄 어벤져 ( 3 % ~ 14 % )
마인드 디펜스 컨버트 : 서브 파워 ( 0.8 % ~ 2.5 % )
마인드 디펜스 컨버트 : 서브 파워 ( 1 % ~ 2.5 % )

웨폰 폼 : [마법 / 정신 / 일루젼 / 2 레벨][마법 / 정신 / 플라즈마 / 3 레벨][마법 / 정신 / 없음 / 4 레벨]


셀레라이트닝 주문서 조각 복원 상태

x 1
x 1
x 0
x 0
x 0
x 0

x 0
x 0
x 0
x 0
x 0
x 0

x 0
x 0
x 0
x 0
x 0
x 0

x 0
x 1
x 0
x 1
x 0
x 1

x 0
x 0
x 0
x 0
x 0
x 0


암시장으로 | 메인 화면으로 `

// 유물 복원시 방어구''
var darkmark2 = `
유물 상세정보
선택한 유물의 상태를 보여줍니다.
복원시의 스펙을 볼 수 있으며, 모든 유물 조각이 필요 세트 수만큼 존재하면 복원을 시도할 수 있습니다.
복원시에는 수수료가 소비되며, 수수료가 없는 경우에는 바로 복원이 가능 합니다.
복원을 통해 수집품이나 장비류를 지급받을 수도 있으며 집이 없거나 창고가 온전하지 않은 경우에는 우편으로 보내집니다. (30 일 내에 수령해야 합니다.)


유물 명칭 	  삼중갑판갑주 조각
유물 등급 	  56 등급
총 조각 / 필요 세트 	  8 조각 / 2 세트 필요
복원 제한 	  복원 제한 없음
복원 옵션 	  복원 세트 누적증가
복원후 세트 리셋
복원 수수료 	[ 아이템 ] 중인형의 인장 24 개
복원 결과물 	  삼중갑판갑주 ( 방어구 )
복원물 정보
	삼중갑판갑주

티어 : [[ 2 ]]
350 렙 이상 / + 3018 / + 662
속성방어 : -440 / + 840 / 0 / + 1960 / -660 / 0

에테르 : 15

****** 피트 ******
디펜시브 아이 (+ 5)
디펜시브 페이즈 (+ 5)
컨트랙트 : 실드 (+ 5)
내구력 (+ 3)
블로우 (-3)
오펜시브 페이즈 (-5)


****** 엘레멘트 소켓 ******
3 개 ~ 3 개

****** 커스텀 ( 6 등급 ) ******
피지컬 디펜스 컨버트 : 어스 ( 1.5 % ~ 4.5 % )
피지컬 디펜스 컨버트 : 어스 ( 1.8 % ~ 4.8 % )
절대 방어 기능 ( 1 % ~ 4 % )
절대 방어 기능 ( 2 % ~ 4 % )
스타라이터 : 페트라 ( 15 ~ 40 )
토레도니아의 유산 ( 10 ~ 40 )
실드 HP 추가 ( 2 % ~ 6 % )
실드 HP 추가 ( 3 % ~ 6 % )
파워 컨버트 : 피지컬 디펜스 ( 1.5 % ~ 4.5 % )



삼중갑판갑주 조각 복원 상태

x 0
x 0

x 0
x 2

x 0
x 0

x 0
x 0


암시장으로 | 메인 화면으로  `
//유물 복원시 악세
var darkmark3 = `
유물 상세정보
선택한 유물의 상태를 보여줍니다.
복원시의 스펙을 볼 수 있으며, 모든 유물 조각이 필요 세트 수만큼 존재하면 복원을 시도할 수 있습니다.
복원시에는 수수료가 소비되며, 수수료가 없는 경우에는 바로 복원이 가능 합니다.
복원을 통해 수집품이나 장비류를 지급받을 수도 있으며 집이 없거나 창고가 온전하지 않은 경우에는 우편으로 보내집니다. (30 일 내에 수령해야 합니다.)


유물 명칭 	  空輝首玉 조각
유물 등급 	  67 등급
총 조각 / 필요 세트 	  18 조각 / 1 세트 필요
복원 제한 	  앞으로 복원이 2 회 가능합니다.
복원 옵션 	  복원 세트 누적증가
복원후 세트 리셋
복원 수수료 	[ 보석 ] 토파즈 38 개
복원 결과물 	  空輝首玉 : 판티에르 ( 악세서리 )
복원물 정보
	空輝首玉 : 판티에르

티어 : [[ 2 ]]
420 렙 이상 / + 1440 / + 1660
속성방어 : 0 / 0 / + 1100 / -350 / 0 / + 1100

에테르 : 8

****** 피트 ******
윈드 업그레이드 (+ 5)
마인드 업그레이드 (+ 5)
학습력 (+ 5)
스마트 아이 (+ 5)
웨더 (+ 3)
기백 (-6)


****** 엘레멘트 소켓 ******
0 개 ~ 3 개

****** 커스텀 ( 7 등급 ) ******
받는 바람 속성 추가 데미지 변화 ( 5 % ~ 12 % )
받는 정신 속성 추가 데미지 변화 ( 5 % ~ 12 % )
스타라이터 : 알티아 ( 10 ~ 45 )
스타라이터 : 제이거 ( 10 ~ 45 )
소울 에메랄드 추출 기능 ( 10 ~ 28 )
아스트랄의 결정 추출 기능 ( 10 ~ 28 )
실드 HP 추가 ( 2 % ~ 5 % )
2 회 공격 기능 ( 2 % ~ 5 % )



空輝首玉 조각 복원 상태

x 1
x 0
x 0

x 1
x 0
x 1

x 2
x 0
x 0

x 2
x 2
x 0

x 0
x 3
x 1

x 1
x 0
x 0


암시장으로 | 메인 화면으로 `
// 필름시   무기
var filmwp1 = `
MRICTX-RAY 촬영 결과


당신이 의뢰한 물품 빗자루 의 촬영 결과는 다음과 같이 나왔습니다.


장비명 	 빗자루
장비 타입 	 무기 	레벨 제한 	 10 렙 이상
장비옵션

속성 	 마법 / 무속성 / 없음 / 1 레벨
공격력 	 주 공격력 : + 30 / 추가타 공격력 : + 10
에테르 	 0
무기대사 	 캐릭터 이름 (이)/가 손짓하자 빗자루가 날아가 적의 얼굴을 밀어버린다.
추가타대사 	 캐릭터 이름
웨폰 폼 	 없음
웨이블렘 스킬
피트 	루엘 (+ 1)
엘레멘트 소켓 	2 개 ~ 3 개
커스텀옵션 	2 회 공격 기능 ( 1 % ~ 10 % ) [100% 확률]


메인 화면으로 | 다른것을 촬영 | 텐시 백화점으로
`




function tetttt(a) {
  if (a.indexOf('업그레이드 정보') != -1) {
    console.log("이것은 리버스 팩토리의 자료입니다")
    if (a.indexOf('대상 무기를') != -1) {
      console.log("이것은 리버스 팩토리의 무기 자료입니다")
      var lines = a.split("\n")
      for (var i = 0; i < lines.length; i++) {
        if (lines[i].indexOf('업그레이드 정보') != -1) {
          var wpname = lines[i+1]
          var wpname = wpname.trim()
          console.log("wpname : " + wpname)
        }
        if (lines[i].indexOf(' 렙 이상') != -1) {
          var wplimit = lines[i].split(' 렙 이상')[0]
          var wpstats = lines[i].split(' 렙 이상 /')[1]
          console.log( "wplimit : " + wplimit)
          console.log( "wpstats : " + wpstats)
          var wpproperty = lines[i+1]
          console.log(wpproperty)

        }

        if (lines[i].indexOf('에테르 : ') != -1) {
            var wpether = lines[i].split('에테르 : ')[1]
            console.log("wpether: "+ wpether)
        }
        if (lines[i].indexOf('** 피트 **') != -1) {

          console.log('피트 라인' + i)
          var featline = i
        }
        if (lines[i].indexOf('** 엘레멘트 소켓 **') != -1) {
          console.log('소켓 라인'+ i)
          var socketline = i
        }
        if (lines[i].indexOf('** 커스텀') != -1) {

          console.log('커스텀라인'+ i)
          var socketline = i
        }
        if (lines[i].indexOf('웨폰 폼') != -1) {

          console.log('커스텀라인'+ i)
          var socketline = i
        }



      }

      var wpfeat = lines[featline +1].trim()

      for (var i = 1; i < socketline-featline-1; i++) {
        if (lines[featline+1+i].trim() =="") {
          continue
        }
        wpfeat += '</br>' + lines[featline+1+i].trim()
      }

      console.log("wpfeat :  "+ wpfeat)


    } else if (a.indexOf('대상 방어구') != -1) {
      console.log("이것은 리버스 팩토리의 방어구 자료입니다")
    } else if (a.indexOf('대상 악세서리') != -1) {
      console.log("이것은 리버스 팩토리의 악세서리 자료입니다")
    }





  } else if (a.indexOf('유물 명칭') != -1) {
    console.log("이것은 유물 복원소 자료입니다")
    if (a.indexOf('( 무기 )') != -1) {
      console.log("이것은 유물 복원소의 무기 자료입니다")
    } else if (a.indexOf('( 방어구 )') != -1) {
      console.log("이것은 유물 복원소의 방어구 자료입니다")
    } else if (a.indexOf('( 악세서리 )') != -1) {
      console.log("이것은 유물 복원소의 악세서리 자료입니다")
    }


  } else {
    console.log("이것은 엑스레이 자료입니다")


  }
}

/*
  var namelines = a.split("\n")[0]
  if (namelines.indexOf("장비명") != -1) {  //
    var namelines = namelines.split("장비명     ")[1]
  }
  var limitNeffectlines = a.split("\n")[3]
  var limit = limitNeffectlines.indexOf(" 렙 이상")
  var limit = limitNeffectlines.substring(0,limit)
  var etherline = a.split("\n")[6]
  var ether = etherline.split("에테르 : ")[1]
  console.log ('이름  '  +  namelines)
  console.log ('제한 및 효과 '  +  limitNeffectlines)
  console.log('레벨 제한  ' + limit)
  console.log('에테르  ' + ether)
  console.log()
  console.log()
  */
  //for (var i = 0; i < lines.length; i++) {
  //  console.log(lines[0])
  //}
tetttt(revers1)
